#+TITLE:Notebook
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC 240 - Data structures with C++ - Lyon College, FA24
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
#+PROPERTY: header-args:python :session *Python* :results output :exports both :noweb yes
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes
#+PROPERTY: header-args:C++ :main yes :includes <iostream> :results output :exports both :noweb yes
** How do choose the right data structure

By building up muscle: solve many problems in different ways.

Example: "Hello" program that greets the user by name
1) Input from the keyboard or from a file
2) Output to the screen or to a file
3) Output with =cout= or =printf=
4) User name stored as =string= or as =char= array
5) User name retrieved with =cin= or with =cin.get= or =scanf=
6) Concatenate greeting message
7) With a user-defined function with or without =return=
8) Passing function parameters by value or by reference
9) With a user-defined class (and a default name)
10) Using a user-defined function and a pointer array

    
*Solutions:*

- Input file
  #+begin_src bash :results output
    echo "Marcus" > input
    cat input
  #+end_src

  #+RESULTS:
  : Marcus

- Input from the keyboard (in Emacs with =:cmdline < input=), using
  =scanf= and =printf= from the =cstdio= library:
  #+begin_src C++ :main yes :includes <cstdio> :cmdline < input :results output :exports both
    char name[100]{};
    scanf("%99s",name); // name is already a pointer to name[0]
    printf("Hello, %s\n", name);
  #+end_src

  #+RESULTS:
  : Hello, Marcus

- Input from keyboard, output to screen, and using a =string= type and
  =cin= and =cout= with stream insertion/extraction operators =>>= and =<<=:
  #+begin_src C++ :cmdline < input :results output :exports both
    #include <iostream>
    #include <string>

    using namespace std;

    int main() {
      // declare variables
      string name;
      // get input
      cin >> name;
      // write output
      cout << "Hello, " << name << endl;

      return 0;
    }
  #+end_src

  #+RESULTS:
  : Hello, Marcus

- Input from file, write output to file, and using a =string= type and
  I/O files with stream insertion/extraction operators =>>= and =<<=:
  #+begin_src C++ :namespaces std :results none :exports both
    #include <iostream>
    #include <string>
    #include <fstream>

    int main() {
      // declare variables
      string name;
      ifstream inFile;
      ofstream outFile;

      // open input and output files
      inFile.open("input");
      outFile.open("output");

      // get input from file and close
      inFile >> name;
      inFile.close();

      // write output to file and close
      outFile << "Hello, " << name;

      return 0;
    }
  #+end_src

  Check the output file:
  #+begin_src bash :results output
    cat output
  #+end_src

  #+RESULTS:
  : Hello, Marcus

- Use user-defined function ~hello~ without, and ~hello2~ with =return=, and
  a =string= for ~name~ in the function:
  #+begin_src C++ :results output :exports both
    #include <iostream>
    #include <string>

    using namespace std;

    // void function prints greeting
    void hello(string name) {
      cout << "Hello, " + name << endl;
    }

    // function returns string
    string hello2(string name) {
      return "Hello, " + name;
    }

    int main() {
      // call function
      hello("Marcus");
      // call another function
      cout << hello2("Marcus");

      return 0;
    }
  #+end_src

  #+RESULTS:
  : Hello, Marcus
  : Hello, Marcus

*** Solution code


#+begin_src C++ :cmdline < input :main yes :includes <iostream> :includes <string> :includes <cstdio> :namespaces std :cmdline < input :results output :exports both
#include <iostream>
#include <string>
#include <cstdio>

using namespace std;

int main() {
    char name[100];  // Array to store the name
    int age;         // Variable to store the age

    // Read the name (string) using scanf without & because name is an array
    scanf("%99s", name);
    // Read the age (integer) using scanf with & because age is a single variable
    scanf("%d", &age);

    // Print the greeting message
    printf("Hello, %s. You are %d years old.\n", name, age);

    return 0;
}
#+end_src

#+RESULTS:
: Hello, John. You are 25 years old.

#+begin_src sh :results output :exports both
echo "John 25" > input
#+end_src

